Repository: core-stack-org/cc-android-offline
Catalog: lib/l10n/app_*.arb
Languages: hi

# selectLocation
source: Select a location
hi: स्थान चुनें

# selectState
source: Select a State
hi: राज्य चुनें

# selectDistrict
source: Select a District
hi: जिला चुनें

# selectTehsil
source: Select a Tehsil
hi: तहसील चुनें

# selectStateDistrictTehsil
source: Select State, District and Tehsil from the dropdown
hi: नीचे दिए गए ड्रॉप-डाउन से राज्य, जिला और तहसील का चयन करें।

source: Online mode
hi: ऑनलाइन मोड

source: Offline mode
hi: ऑफलाइन मोड

source: Submit
hi: जमा करें

# onlineModeSelected
source: You have selected ONLINE mode
hi: आपने ऑनलाइन मोड चुना है

# offlineModeSelected
source: You have selected OFFLINE mode
hi: आपने ऑफलाइन मोड चुना है

# betaOfflineNote
source: *BETA Offline mode works in remote areas without internet with limited features.
hi: *बीटा ऑफलाइन मोड सीमित सुविधाओं के साथ इंटरनेट के बिना दूरदराज के क्षेत्रों में काम करता है।

source: version:
hi: संस्करण:

source: File a bug report
hi: बग रिपोर्ट दर्ज करें

source: What's New
hi: नया क्या है

source: Access Application without Internet
hi: इंटरनेट के बिना एप्लिकेशन तक पहुंचें

# downloadLayersMessage
source: To download the layers for offline connectivity, please tick off agree and press on download button. The layers will take around 300 MB of your phone storage.
hi: ऑफलाइन कनेक्टिविटी के लिए लेयर डाउनलोड करने हेतु, कृपया सहमत पर टिक करें और डाउनलोड बटन दबाएं। लेयर आपके फोन स्टोरेज का लगभग 300 MB लेंगे।

source: Agree and Download Layers
hi: सहमत हैं और लेयर डाउनलोड करें

source: Download Layers
hi: लेयर डाउनलोड करें

# pleaseSelectStateDistrictBlock
source: Please select State, District, and Block.
hi: कृपया राज्य, जिला और ब्लॉक चुनें।

source: Error loading offline view:
hi: ऑफलाइन व्यू लोड करने में त्रुटि:

# couldNotOpenEmailClient
source: Could not open email client. Please send your report to support@core-stack.org
hi: ईमेल क्लाइंट नहीं खोल सके। कृपया अपनी रिपोर्ट support@core-stack.org पर भेजें

# createNewRegion
source: Create a new region
hi: नया क्षेत्र बनाएं

# markLocationOnMap
source: Mark a location on the map
hi: मानचित्र पर स्थान चिह्नित करें

source: Name your region
hi: अपने क्षेत्र का नाम दें

source: Create Region
hi: क्षेत्र बनाएं

# pleaseEnterRegionName
source: Please enter a region name
hi: कृपया क्षेत्र का नाम दर्ज करें

source: Select a region
hi: एक क्षेत्र चुनें

# looksLikeNoRegionsCreated
source: Looks like there are no regions created yet
hi: लगता है अभी तक कोई क्षेत्र नहीं बनाया गया है

# pleaseCreateRegionToStart
source: Please create a region to start using the app
hi: ऐप का उपयोग शुरू करने के लिए कृपया एक क्षेत्र बनाएं

source: Ready for offline use
hi: ऑफलाइन उपयोग के लिए तैयार

source: Not yet downloaded
hi: अभी तक डाउनलोड नहीं हुआ

source: Refresh all layers
hi: सभी लेयर रीफ्रेश करें

source: Refresh plan layers only
hi: केवल योजना लेयर रीफ्रेश करें

source: Delete region
hi: क्षेत्र हटाएं

# deleteRegionConfirmTitle
source: Delete Region
hi: क्षेत्र हटाएं

# deleteRegionConfirmMessage
source: This will delete all offline data for {regionName}. Continue?
hi: यह {regionName} के लिए सभी ऑफलाइन डेटा हटा देगा। जारी रखें?

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएं

# regionDeleted
source: Region {regionName} deleted
hi: क्षेत्र {regionName} हटा दिया गया

source: New Region
hi: नया क्षेत्र

source: Navigate
hi: नेविगेट करें

source: Refresh Layers
hi: लेयर रीफ्रेश करें

# layersNotDownloaded
source: The layers for this region are not yet downloaded. Do you want to refresh all layers now?
hi: इस क्षेत्र के लिए लेयर अभी तक डाउनलोड नहीं हुए हैं। क्या आप अभी सभी लेयर रीफ्रेश करना चाहते हैं?

source: Refresh
hi: रीफ्रेश करें

source: Region Mismatch
hi: क्षेत्र मेल नहीं खाता

# regionMismatchMessage
source: The selected region does not match with the selected State, District and Tehsil.
hi: चयनित क्षेत्र चयनित राज्य, जिला और तहसील से मेल नहीं खाता।

source: OK
hi: ठीक है

# couldNotFindBlockInfo
source: Could not find block information to re-download.
hi: पुनः डाउनलोड के लिए ब्लॉक जानकारी नहीं मिली।

# refreshingPlanData
source: Refreshing plan data for {regionName}...
hi: {regionName} के लिए योजना डेटा रीफ्रेश हो रहा है...

# couldNotFindBlockInfoRefresh
source: Could not find block information to refresh.
hi: रीफ्रेश के लिए ब्लॉक जानकारी नहीं मिली।

source: No plan layers to refresh.
hi: रीफ्रेश करने के लिए कोई योजना लेयर नहीं।

# successfullyRefreshedPlanData
source: Successfully refreshed plan data for {regionName}
hi: {regionName} के लिए योजना डेटा सफलतापूर्वक रीफ्रेश हो गया

# errorRefreshingData
source: Error refreshing data: {error}
hi: डेटा रीफ्रेश करने में त्रुटि: {error}

source: Latitude
hi: अक्षांश (lat)

source: Longitude
hi: देशांतर (lon)

source: Return to Location Selection
hi: स्थान चयन पर वापस जाएं

source: Return to Plan Selection
hi: योजना चयन पर वापस जाएं

# loginTitle
source: Please login to continue
hi: कृपया जारी रखने के लिए लॉगिन करें

source: Phone number
hi: फोन नंबर

# phoneNumberHint
source: Enter your phone number
hi: अपना फोन नंबर दर्ज करें

source: Password
hi: पासवर्ड

# passwordHint
source: Enter your password
hi: अपना पासवर्ड दर्ज करें

source: Login
hi: लॉगिन

# pleaseEnterPhoneNumber
source: Please enter your phone number
hi: कृपया अपना फोन नंबर दर्ज करें

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
hi: कृपया एक वैध फोन नंबर दर्ज करें

source: Phone number should be at least 10 digits
hi: फोन नंबर कम से कम 10 अंकों का होना चाहिए

# pleaseEnterPassword
source: Please enter your password
hi: कृपया अपना पासवर्ड दर्ज करें

# invalidUsernameOrPassword
source: Invalid username or password. Please try again.
hi: अमान्य उपयोगकर्ता नाम या पासवर्ड। कृपया फिर से कोशिश करें।

# networkErrorMessage
source: Network error. Please check your connection and try again.
hi: नेटवर्क त्रुटि। कृपया अपना कनेक्शन जांचें और फिर से कोशिश करें।

# usernameOrPhoneNumber
source: Phone number
hi: फोन नंबर

# usernameOrPhoneNumberHint
source: Enter your phone number
hi: फोन नंबर दर्ज करें

# pleaseEnterUsernameOrPhoneNumber
source: Please enter your phone number
hi: कृपया फोन नंबर दर्ज करें

source: Place your marker
hi: अपना मार्कर रखें

source: Add Lat/Lon
hi: अक्षांश/देशांतर जोड़ें

source: Enter Coordinates
hi: निर्देशांक दर्ज करें

source: Please enter latitude
hi: कृपया अक्षांश दर्ज करें

source: Please enter longitude
hi: कृपया देशांतर दर्ज करें

# pleaseEnterValidNumber
source: Please enter a valid number
hi: कृपया एक वैध संख्या दर्ज करें

# latitudeMustBeBetween
source: Latitude must be between -90 and 90
hi: अक्षांश -90 और 90 के बीच होना चाहिए

# longitudeMustBeBetween
source: Longitude must be between -180 and 180
hi: देशांतर -180 और 180 के बीच होना चाहिए

source: Done
hi: पूर्ण

source: Confirm
hi: पुष्टि करें

# locationServicesDisabled
source: Location services are disabled. Please enable them.
hi: स्थान सेवाएं अक्षम हैं। कृपया उन्हें सक्षम करें।

# locationPermissionsDenied
source: Location permissions are denied
hi: स्थान अनुमतियां अस्वीकृत हैं

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied, we cannot request permissions.
hi: स्थान अनुमतियां स्थायी रूप से अस्वीकृत हैं, हम अनुमतियों का अनुरोध नहीं कर सकते।

source: Moved to current location
hi: वर्तमान स्थान पर पहुंचे

# errorGettingLocation
source: Error getting location: {error}
hi: स्थान प्राप्त करने में त्रुटि: {error}

source: Select Map Layer
hi: मानचित्र परत चुनें

# defaultLayer
source: Default
hi: डिफ़ॉल्ट

# openStreetMapLayer
source: OpenStreetMap
hi: ओपनस्ट्रीटमैप

source: Change map layer
hi: मानचित्र परत बदलें

source: Go to current location
hi: वर्तमान स्थान पर जाएं

source: Zoom in
hi: ज़ूम इन

source: Zoom out
hi: ज़ूम आउट

source: Downloading Layers
hi: लेयर डाउनलोड हो रही हैं

# doNotClosePageWhileDownloading
source: Please do not close this page while download process is in progress.
hi: कृपया डाउनलोड प्रक्रिया चल रहे समय इस पेज को बंद न करें।

source: Region name:
hi: क्षेत्र का नाम:

# estimatedTimeToDownload
source: Estimated time to download: 10 minutes
hi: डाउनलोड का अनुमानित समय: 10 मिनट

source: Download Status
hi: डाउनलोड स्थिति

source: Base Map
hi: बेस मैप

source: Retry
hi: पुनः प्रयास

source: Vector Layers
hi: वेक्टर लेयर

# completedOf
source: {completed} of {total} completed
hi: {total} में से {completed} पूर्ण

source: Plan Layers
hi: योजना लेयर

source: Raster Layers (GeoTIFF + PNG)
hi: रास्टर लेयर (GeoTIFF + PNG)

source: Form Data Files
hi: फॉर्म डेटा फाइलें

source: Web App Files
hi: वेब ऐप फाइलें

source: CLART Layer (GeoTIFF)
hi: CLART लेयर (GeoTIFF)

source: CLART Layer (PNG)
hi: CLART लेयर (PNG)

source: Downloading Offline Data
hi: ऑफलाइन डेटा डाउनलोड हो रहा है

# preparingToDownload
source: Preparing to download {containerName}
hi: {containerName} डाउनलोड करने की तैयारी हो रही है

# downloadedPercent
source: Downloaded {percent}% for {containerName}
hi: {containerName} के लिए {percent}% डाउनलोड हो गया

# successfullyDownloadedData
source: Successfully downloaded data for the region: {containerName}
hi: क्षेत्र के लिए डेटा सफलतापूर्वक डाउनलोड हो गया: {containerName}

# failedToDownloadData
source: Failed to download data: {error}
hi: डेटा डाउनलोड करने में विफल: {error}

source: Download cancelled.
hi: डाउनलोड रद्द कर दिया गया।

source: Base map downloaded successfully
hi: बेस मैप सफलतापूर्वक डाउनलोड हो गया

# failedToRetryBaseMap
source: Failed to retry base map: {error}
hi: बेस मैप पुनः प्रयास में विफल: {error}

source: Vector layers retry completed
hi: वेक्टर लेयर पुनः प्रयास पूर्ण

# failedToRetryVectorLayers
source: Failed to retry vector layers: {error}
hi: वेक्टर लेयर पुनः प्रयास में विफल: {error}

source: Plan layers retry completed
hi: योजना लेयर पुनः प्रयास पूर्ण

# failedToRetryPlanLayers
source: Failed to retry plan layers: {error}
hi: योजना लेयर पुनः प्रयास में विफल: {error}

source: Form data retry completed
hi: फॉर्म डेटा पुनः प्रयास पूर्ण

# failedToRetryFormData
source: Failed to retry form data: {error}
hi: फॉर्म डेटा पुनः प्रयास में विफल: {error}

source: Image layers downloaded successfully
hi: इमेज लेयर सफलतापूर्वक डाउनलोड हो गईं

# someImageLayersFailed
source: Some image layers failed. Check individual statuses.
hi: कुछ इमेज लेयर विफल रहीं। व्यक्तिगत स्थिति देखें।

# failedToRetryImageLayers
source: Failed to retry image layers: {error}
hi: इमेज लेयर पुनः प्रयास में विफल: {error}

source: Web app files retry completed
hi: वेब ऐप फाइलें पुनः प्रयास पूर्ण

# failedToRetryWebApp
source: Failed to retry web app: {error}
hi: वेब ऐप पुनः प्रयास में विफल: {error}

source: Download Complete
hi: डाउनलोड पूर्ण

# allLayersDownloadedSuccessfully
source: All layers have been downloaded successfully. You can now access this region offline.
hi: सभी लेयर सफलतापूर्वक डाउनलोड हो गई हैं। अब आप इस क्षेत्र को ऑफलाइन एक्सेस कर सकते हैं।

source: Download Incomplete
hi: डाउनलोड अधूरा

# someLayersFailedToDownload
source: Some layers failed to download. You can retry failed layers or exit. The container will not be marked as complete.
hi: कुछ लेयर डाउनलोड होने में विफल रहीं। आप विफल लेयर पुनः प्रयास कर सकते हैं या बाहर निकल सकते हैं। कंटेनर को पूर्ण के रूप में चिह्नित नहीं किया जाएगा।

source: Exit Anyway
hi: फिर भी बाहर निकलें

source: Exit
hi: बाहर निकलें

source: Profile
hi: प्रोफ़ाइल

source: Not specified
hi: निर्दिष्ट नहीं

source: Personal Information
hi: व्यक्तिगत जानकारी

source: Username
hi: उपयोगकर्ता नाम

source: Email
hi: ईमेल

source: Contact Number
hi: संपर्क नंबर

source: User ID
hi: उपयोगकर्ता आईडी

# organizationAndRole
source: Organization & Role
hi: संगठन और भूमिका

source: Organization
hi: संगठन

source: Organization ID
hi: संगठन आईडी

source: Role(s)
hi: भूमिका(एं)

source: Projects
hi: परियोजनाएं

source: No projects assigned
hi: कोई परियोजना नहीं सौंपी गई

source: No roles assigned
hi: कोई भूमिका नहीं सौंपी गई

source: Unknown Project
hi: अज्ञात परियोजना

source: Admin Status
hi: व्यवस्थापक स्थिति

source: Super Administrator
hi: सुपर व्यवस्थापक

source: Security
hi: सुरक्षा

source: Change Password
hi: पासवर्ड बदलें

source: Update your account password
hi: अपने खाते का पासवर्ड अपडेट करें

source: App Data
hi: ऐप डेटा

source: Clear Cache
hi: कैश साफ़ करें

source: Clear WebView cache and cookies
hi: वेबव्यू कैश और कुकीज़ साफ़ करें

source: Current Password
hi: वर्तमान पासवर्ड

source: New Password
hi: नया पासवर्ड

source: Confirm New Password
hi: नए पासवर्ड की पुष्टि करें

# youWillBeLoggedOut
source: You will be logged out from all devices
hi: आप सभी उपकरणों से लॉग आउट हो जाएंगे

# minPasswordRequirements
source: Min 8 chars, alphanumeric, special symbols
hi: कम से कम 8 अक्षर, अल्फान्यूमेरिक, विशेष प्रतीक

# allFieldsRequired
source: All fields are required
hi: सभी फ़ील्ड आवश्यक हैं

source: New passwords do not match
hi: नए पासवर्ड मेल नहीं खाते

# passwordMustBeAtLeast8
source: Password must be at least 8 characters
hi: पासवर्ड कम से कम 8 अक्षरों का होना चाहिए

# passwordMustContainLettersNumbersSpecial
source: Password must contain letters, numbers, and special characters
hi: पासवर्ड में अक्षर, संख्या और विशेष वर्ण होने चाहिए

source: Network error occurred
hi: नेटवर्क त्रुटि हुई

# invalidCurrentPassword
source: Invalid current password or password requirements not met
hi: अमान्य वर्तमान पासवर्ड या पासवर्ड आवश्यकताएं पूरी नहीं हुईं

# currentPasswordIncorrect
source: Current password is incorrect
hi: वर्तमान पासवर्ड गलत है

# failedToChangePassword
source: Failed to change password. Please try again.
hi: पासवर्ड बदलने में विफल। कृपया पुनः प्रयास करें।

source: Password Changed
hi: पासवर्ड बदल गया

# passwordUpdatedSuccessfully
source: Your password has been updated successfully.
hi: आपका पासवर्ड सफलतापूर्वक अपडेट हो गया है।

# youWillBeLoggedOutPleaseLogin
source: You will be logged out. Please login again.
hi: आप लॉग आउट हो जाएंगे। कृपया फिर से लॉगिन करें।

# clearCacheTitle
source: Clear Cache
hi: कैश साफ़ करें

# clearCacheMessage
source: This will clear all WebView cache and cookies. The app may need to reload data.
hi: यह सभी वेबव्यू कैश और कुकीज़ साफ़ कर देगा। ऐप को डेटा पुनः लोड करने की आवश्यकता हो सकती है।

source: This action cannot be undone
hi: इस क्रिया को पूर्ववत नहीं किया जा सकता

source: Cache cleared successfully!
hi: कैश सफलतापूर्वक साफ़ हो गया!

source: Failed to clear cache
hi: कैश साफ़ करने में विफल

# unableToLoadProfile
source: Unable to load profile data
hi: प्रोफ़ाइल डेटा लोड करने में असमर्थ
